
#트위터 크롤링
#https://velog.io/@chaeri93/Python-%ED%8A%B8%EC%9C%84%ED%84%B0-API%EB%A1%9C-%ED%81%AC%EB%A1%A4%EB%A7%81%ED%95%98%EA%B8%B0

#유튜브 크롤링
# https://jnaul.tistory.com/316

#유튜브 재생 목록 생성
# https://chatgpt.com/

#시나리오
#1. 트위터에서 최대 1년까지의 게시물을 긁는다(optional 하게)
#2. 게시물 중 태진 노래방의 업데이트 노래만 긁어온다.
#   영상은 따로 저장해놓고 추후 저장된 영상들을 확인하여 제대로 긁어왔는지 확인
#3. 각 태진 노래방의 리스트업 된 가수 - 노래 list를 이용하여 유튜브에서 검색 리스트를 긁어온다.
#4. 이 리스트를 정렬(영상 길이, 조회수 등을 비교)하여 각 게시물들 중 가장 노래에 가까운 영상들만 뽑는다.
#5. 해당 리스트들을 일일이 유튜브 재생 리스트에 등록
#6. 제대로 됐는지는 내가 확인하면 될듯 ㅇㅇㅇㅇ
